#!/usr/bin/env python


import os, sys
from openpyxl import Workbook
from datetime import datetime
import dbtools3 as dbt

ids_db = {
		'b03':	'host=127.0.0.1 dbname=b03 port=5432 user=smirnov',
	#	'vms':	'host=10.40.25.176 dbname=vms_ws port=5432 user=vms',
		'vms':	'host=10.10.2.147 dbname=vms_ws port=5432 user=vms',	# DBMS-Test:
		# 'cntr':	'host=212.193.103.20 dbname=contracts port=5432 user=smirnov',
		'cntr':	'host=10.10.2.241 dbname=contracts port=5432 user=smirnov',	# Houm
		'recv':	'host=10.10.2.241 dbname=receiver port=5432 user=smirnov',	# Houm
	}
#	cat /proc/sys/kernel/hostname
#	psql -h 212.193.103.20 -U smirnov contracts	'%EGTS%прибор%'
qegts_orgs = """SELECT id_org, s.label, inn, kpp, ogrn, bank, bname, rname FROM vorganizations o, subsys s WHERE bm_ssys = s.code
	AND id_org IN (
	SELECT id_org FROM wtransports WHERE id_ts IN (
	SELECT autos FROM atts WHERE mark LIKE '%EGTS%прибор%' AND autos IN (
	SELECT id_ts FROM wtransports)) GROUP BY id_org);
	"""
qvms_ts = 	"""SELECT nd.id, imei, nd.code, nd.name, nd.phone, nd.phone2,
	nd.operator1_id, nd.operator2_id, nd.icc_id1, nd.icc_id2, nd.devicetype_id,	--yu
	nt.description as marka, t2d.id as t2d_id, atl.transport_id, atl.begindate, t.regnum, t.garagenum, t.contractnumber,
	t.transporttype_id, t.yearofcar, t.category_id, t.vinnumber, t.ptsnumber, t.ptsdate, t.registrationdate, t.registrationnumber, --yu
	tt.code AS tmarka, tt.description AS tmodele, co.inn, ss.code AS sscode, tg.code AS tgroup, tk.description AS tkdescription
	FROM navigationdevice nd
	INNER JOIN transport2devicelink t2d on t2d.device_id=nd.id
	INNER JOIN abstracttransportlink atl on atl.id=t2d.id AND atl.isdeleted = 0 AND atl.enddate IS NULL
	INNER JOIN transport t on atl.transport_id=t.id
	INNER JOIN subsystem ss ON ss.id = t.subsystem_id
	INNER JOIN transporttype tt ON tt.id = t.transporttype_id
	INNER JOIN navigationdevicetype nt ON nt.id = nd.devicetype_id
	LEFT JOIN transportgroup tg ON tg.id = t.group_id
	LEFT JOIN contractor co ON co.id = t.owner_id
	JOIN transportkind tk ON transportkind_id = tk.id
	WHERE nd.isdeleted=0 %s
	ORDER BY contractnumber	-- nd.id
	"""
operators = {
	4026234739: 'МТС', 4069024372: 'Мегафон', 4069024373: 'Билайн', 4309109521: 'НСС',
	4501847583: 'Ростелеком', 5246673376: 'Tele2', 10877759658: 'ГудЛайн',
	}
orecv_dict = {
	'02-20/ОП': "Смотр", '03-20/ОП': "Ниса", '04-20/ОП': "Артикул", '05-20/ОП': "Меркурий НН",
	'06-20/ОП': "Сантел сервис", '07-20/ОП':"Навигационные технологии",
	'08-20/ОП': "Технотрейд НН", '09-20/ОП': "Вектор", '11-20/ОП': "Навигационные решения",
}
idorg_dict = {	'02-20/ОП': 513, '03-20/ОП': 687, '04-20/ОП': 682, '05-20/ОП': 589, '06-20/ОП': 686, '07-20/ОП': 851, '08-20/ОП': 913, }

ssys_dict = {
	1: 'Тест БО', 2: 'СМУ ПП', 4: 'СМУ ША', 8: 'СМ ЖКХ', 16: 'СМ СОГ', 32: 'СМУ ОВ', 64: 'ЖКХ-М', 128: 'СМП', 256: 'ЧТС',
	2048: 'ПП ЦДС', 4096: 'ПП НПАП', 8192: 'ВТ', 16384: 'СХ', 32768: 'ЛХ', 65536: 'МСПОРТ', 131072: 'ДТ-НН', 262144: 'ДТ-НО', 524288: 'КТ',
}
IDB_VMS = None		# Id DataBase vms_ws
IDB_CNTR = None		# Id DataBase contracts

work_directory = r'./tmp/'
# data_directory = r'./data/'


def colab(j):
	""" Формировать сод колнки по индексу    """
	xls_columns = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
	k = j // len(xls_columns)
	if k == 0:		return xls_columns[j]
	return colab(k-1)+colab(j%len(xls_columns))


def data2xlsx(tname, head:list, values, fname = None, cwidth:dict = None):
	""" Фпрмироать *.xlsx файл
	:param tname - 	sheet.title
	:param heas - 	наименование колонок [['A1', 'COD'], ['B1', 'NAME'], ...]
	:param values -	данные [[r0, r1, ...], [r...], ...] или ((r0, r1, ...), (r, ...), ...)
	:param fname -	имя файла + dt.strftime("_%Y%m%d_%H%M%S") + '.xlsx'
	:param cwidth -	ширина колонок {'A': 32, 'B': 32, 'D': 20, 'E': 32, ...}
	"""
	dt = datetime.now()

	# Создать рабочую книгу в Excel:
	wb = Workbook()
	sheet = wb.active
	sheet.title =  tname if tname else 'data'
	# Добавить заголовки в рабочую книгу Excel:
	for k, name in head:
		sheet[k] = name
	if cwidth:
		for k in cwidth.keys():
			sheet.column_dimensions[k].width = cwidth[k]
	row = 1		# Заголовок 1 строка !!!
	# Заполнить данными
	for item in values:
		row += 1
		for j in range(len(item)):
			sheet[colab(j)+str(row)] = item[j]
	# Второй лист	???
	# Сохранить файл:
	filename = (fname if fname else 'data') + dt.strftime("_%Y%m%d_%H%M%S") + '.xlsx'
	wb.save(os.path.join(work_directory, filename))

#########################################

def	table_to_xlsx (sidb, tname, query, fname = None):
	""" Конвертировать таблицу в *.xlsx файл	"""
	idb = dbt.dbtools(ids_db[sidb])	# 'host=127.0.0.1 dbname=b03 port=5432 user=smirnov')
	rows = idb.get_rows(query)
	if not rows:	return
	d = idb.desc
	heads = []
	for j in range(len(d)):
		heads.append([colab(j)+'1', d[j].upper()])
	print(heads)
	data2xlsx(tname, heads, rows, fname, cwidth={'A': 14, 'B': 14, 'C': 14, 'D': 14, 'E': 14, 'F': 14})


def	vms_handbks ():
	""" Выгрузить справочники	"""
	tab_list = ['transporttype', 'navigationdevicetype', 'cellularoperator']
	for tn in tab_list:
	#	table_to_xlsx('vms', tn, "SELECT * FROM %s WHERE id >0 ORDER BY id" % tn, tn)
		table_to_xlsx('vms', tn, "SELECT * FROM %s WHERE isdeleted = 0 ORDER BY id" % tn, tn)


org_hdesc = [
	{'c': 'name',	'w': 32, 'ru':		'краткое наименование'},
	{'c': 'fullname',	'w': 32, 'ru':	'полное наименование'},
	{'c': 'ogrn',	'w': 20, 'ru': 'ОГРН'},
	{'c': 'inn',	'w': 20, 'ru': 'ИНН'},
	{'c': 'legalAddress',	'w': 32, 'ru': 'юридический адрес'},
	{'c': 'postAdress',	'w': 32, 'ru': 'фактический адрес'},
	{'c': 'phone', 'ru': 'контактный телефон'},
	{'c': 'priorGroupName',	'w': 22, 'ru': 'приоритетная группа пользователя'},
	{'c': 'regionName',	'w': 22, 'ru': 'район'},
	{'c': 'subSystemCode',	'ru': 'подсистема'},]

def	orgs2xlsx (**kwargs):
	""" Поиск организаций и формирование *.xlsx файла	"""
	xls_columns = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
	if kwargs.keys():
		print(kwargs)
		fname = kwargs['fout'] if kwargs.get('fout') else 'organizations'
		IDB_CNTR = dbt.dbtools(ids_db['cntr'])
		inn_list = kwargs.get('inns')
		if not inn_list and 'swhere' in kwargs.keys():
			query = "SELECT inn FROM organizations WHERE " +kwargs.get('swhere')
			print(query)
			rows = IDB_CNTR.get_rows(query)
			if rows:
				inn_list = []
				for r in rows:	inn_list.append(r[0])

		if inn_list:
			fname = kwargs.get('fout') if 'fout' in kwargs.keys() else 'organizations'
			colms = []
			heads = []
			cwidth = {}
			for j in range(len(org_hdesc)):
				# print(org_hdesc[j])
				colms.append(org_hdesc[j].get('c'))
				heads.append([xls_columns[j] +'1', org_hdesc[j].get('ru')])
				cwidth[xls_columns[j]] = org_hdesc[j]['w'] if org_hdesc[j].get('w') else 12
			rows = []
			print(fname, heads, cwidth)

			for inn in inn_list:
				dr = get_org_descript(inn, fout=False)
				r = []
				for j in range(len(org_hdesc)):
					r.append(dr.get(colms[j]))
				rows.append(r)
				# print(r)
			data2xlsx(fname, heads, rows, fname, cwidth=cwidth)
		else:	print("orgs2xlsx Нет inn_list")
	else:	print("orgs2xlsx Нет аргуметов")

def	get_org_descript (inn, fout=True):
	""" Читать описание организации по ИНН в БД contracts  """
	global	IDB_VMS, IDB_CNTR
	dorg = {}
	if not IDB_CNTR:	IDB_CNTR = dbt.dbtools(ids_db['cntr'])
	# Contracts
	query = "SELECT * FROM vorganizations WHERE inn = %s" % inn
	drow = IDB_CNTR.get_dict(query)
	if fout:	print(inn, '='*33)
	for k in drow.keys():
		if k in ['id_org', 'p_org', 'label', 'region', 'rem', 'bl_mail']:	continue
		if drow[k]:
			if k == 'fname':	dorg['fullname'] = drow[k]
			elif k == 'bname':	dorg['name'] = drow[k]
			elif k == 'ogrn':	dorg['ogrn'] = drow[k]
			elif k == 'inn':	dorg['inn'] = drow[k]
			elif k == 'rname':	dorg['regionName'] = drow[k]
			elif k == 'bm_ssys':	dorg['subSystemCode'] = "%s %s" % (drow[k], ssys_dict.get(drow[k]))
			elif k == 'prior_group_name':	dorg['priorGroupName'] = drow[k]
			elif k == 'ur_addr':	dorg['legalAddress'] = drow[k]
			elif k == 'fact_addr':	dorg['postAdress'] = drow[k]
			elif k == 'phone':	dorg['phone'] = drow[k]
		#	elif k == '':	dorg[''] = drow[k]
			# else:	print("%16s" % k, drow[k])
	if fout and dorg:
		print('#'*22)
		for k in dorg.keys():
			print('%22s:' % k, dorg[k])
	return dorg

def	vms_find_orgs (qand=None):
	""" Поиск организаций по № договора (contractnumber) БД vms_ws	"""
	global	IDB_VMS, IDB_CNTR

	query = qvms_ts % qand
	# print(query)
	if not IDB_CNTR:	IDB_CNTR = dbt.dbtools(ids_db['cntr'])
	if not IDB_VMS:		IDB_VMS = dbt.dbtools(ids_db['vms'])
	rows = IDB_VMS.get_rows(query)
	d = IDB_VMS.desc
	devids = []
	cnumber = ''
	for r in rows:
		if r[d.index('contractnumber')] != cnumber:
			if devids:
				""" Установать связь ТС с организацией ретранслируещей данные id_opr  ""
				qup_id_opr = "UPDATE transports SET id_opr = %s WHERE device_id IN (%s)" % (
					idorg_dict[cnumber] if idorg_dict.get(cnumber) else -1,
					str(devids)[1:-1])
				print(cnumber, orecv_dict.get(cnumber), IDB_CNTR.execute(qup_id_opr))    #, devids)
				"""
				print(cnumber, orecv_dict.get(cnumber))    #, devids)
				q = """SELECT id_org, bname, inn, bm_ssys FROM organizations WHERE id_org IN (
				SELECT id_org FROM transports WHERE device_id IN (%s) GROUP BY id_org) ORDER BY bm_ssys""" % str(devids)[1:-1]
				rrs = IDB_CNTR.get_rows(q)
				for idorg, onmae, inn, ssys in rrs:
					print('\t', inn, "\t%8s\t%s" % (ssys_dict.get(ssys), onmae))
			devids = [r[d.index('id')]]
			cnumber = r[d.index('contractnumber')]
		else:
			devids.append(r[d.index('id')])
	if devids:
			""" Установать связь ТС с организацией ретранслируещей данные id_opr  ""
			qup_id_opr = "UPDATE transports SET id_opr = %s WHERE device_id IN (%s)" % (
				idorg_dict[cnumber] if idorg_dict.get(cnumber) else -1,
				str(devids)[1:-1])
			print(cnumber, orecv_dict.get(cnumber), IDB_CNTR.execute(qup_id_opr))    #, devids)
			"""
			print(cnumber, orecv_dict.get(cnumber), idorg_dict.get(cnumber))  #, devids)
			q = """SELECT id_org, bname, inn, bm_ssys FROM organizations WHERE id_org IN (
			SELECT id_org FROM transports WHERE device_id IN (%s) GROUP BY id_org) ORDER BY bm_ssys""" % str(devids)[1:-1]
			rrs = IDB_CNTR.get_rows(q)
			for idorg, onmae, inn, ssys in rrs:
				print('\t', inn, "\t%8s\t%s" % (ssys_dict.get(ssys), onmae))
	# print(len(rows), qand)


def	contracts_get_ts (inn=None, qand=None):
	""" Поиск ТС в БД contracts по ИНН организации или условию "AND contractnumber LIKE '%0/ОП'"	"""
	global IDB_CNTR

	query = "SELECT id_ts, garnum, gosnum, marka, t.modele, yearofcar, ptsnumber, ptsdate, registrationnumber, registrationdate, vinnumber, uin, sim_1, sim_2, last_date " \
			"FROM transports t JOIN atts a ON t.id_ts = a.autos " \
			"WHERE id_org IN (SELECT id_org FROM organizations WHERE inn = %s) LIMIT 5" % inn
	print(query)
	if not IDB_CNTR:	IDB_CNTR = dbt.dbtools(ids_db['cntr'])
	rows = IDB_CNTR.get_rows(query)
	d = IDB_CNTR.desc
	print(d)
	heads = []
	lines = []
	cwidth = {}
	for j in range(len(ttsc_order)):
		# print(ttsc_order[j])	#, type(rows[0][d.index(ttsc_order[j])]), rows[0][d.index(ttsc_order[j])])
		cname = ttsc_desc.get(ttsc_order[j])
		# if not cname:    cname = d[j].upper()
		if colab(j) in 'CDEGHX':
			cwidth[colab(j)] = 24
		elif colab(j) in 'UVY':
			cwidth[colab(j)] = 16
		else:
			cwidth[colab(j)] = 12
		heads.append([colab(j) + '1', cname])
		# print(cname)
		'''
		# print(ttsc_order[j], cname)
		v = rows[0][d.index(j)]
		if type(v) == str:
			cwidth[colab(j)] = 12 if len(v) < 12 else 24
		elif type(v) == int:
			cwidth[colab(j)] = 8
		else:
			cwidth[colab(j)] = 16
		'''
	print(heads)
	print(cwidth)
	for r in rows:
		print(r)
		l = []
		l.append(r[d.index('garnum')])
		l.append(r[d.index('gosnum')])
		l.append(r[d.index('marka')])
		l.append(r[d.index('modele')])
		l.append('Navtelecom Signal S-2551')
		l.append(r[d.index('uin')])
		l.append(r[d.index('uin')])
		l.append(None)
		# l.append(r[d.index('')])
		print(l)

		lines.append(l)
	# fname = "ts_list_%s" % inn
	# data2xlsx('Транпорт', heads, lines, fname, cwidth=cwidth)


def	receiver_get_ts ():
	idb_receiver = dbt.dbtools(ids_db['recv'])
	query = "SELECT gosnum, device_id, inn, bname FROM vrecv_ts WHERE bm_ssys = 64 ORDER BY bname"
	rows = idb_receiver.get_rows(query)
	if not rows:    return

	d = idb_receiver.desc
	lines = []
	heads = []
	cwidth = {}
	lnrow = len(d)
	for j in range(lnrow):
		heads.append([colab(j) + '1', d[j].upper()])
		# heads.append(d[j].upper())
		cwidth[colab(j)] = 18
	for r in rows:
		l = []
		gosnum, device_id, inn, bname = r
		print (gosnum, device_id, inn, bname)
		for j in range(lnrow):
			l.append(r[j])
		lines.append(l)

	if lines:
		fname = "TS_64_list"
		data2xlsx('Wialon IPS UDP', heads, lines, fname, cwidth=cwidth)


def	vms_get_ts (inn=None, qand=None):
	""" Поиск ТС в БД vms_ws по ИНН организации или условию "AND contractnumber LIKE '%0/ОП'"	"""
	global	IDB_VMS

	sand = "AND co.inn = '%s'" % inn if inn else ''
	if qand:	sand += qand

	query = qvms_ts % sand
	# print(query)
	if not IDB_VMS:
		IDB_VMS = dbt.dbtools(ids_db['vms'])
	rows = IDB_VMS.get_rows(query)
	if not rows:    return
	
	d = IDB_VMS.desc
	print(d)
	heads = []
	lines = []
	cwidth = {}
	for j in range(len(ttsc_order)):
		# print(ttsc_order[j], type(rows[0][d.index(ttsc_order[j])]), rows[0][d.index(ttsc_order[j])])
		cname = ttsc_desc.get(ttsc_order[j])
		if not cname:	cname = ttsc_order[j].upper()
		# print(ttsc_order[j], cname)
		heads.append([colab(j) + '1', cname])
		v = rows[0][d.index(ttsc_order[j])]
		if type(v) == str:			cwidth[colab(j)] = 12 if len(v) < 12 else 24
		elif type(v) == int:		cwidth[colab(j)] = 8
		else:			cwidth[colab(j)] = 16
	# print(cwidth)
	dsuffix = ['16/М', '17/М', '18/М']
	for r in rows:
		l = []
		for k in ttsc_order:
			if 'date' in k and r[d.index(k)]:
				l.append(str(r[d.index(k)]).split(' ')[0])
			elif 'operator' in k and r[d.index(k)]:
				l.append(operators.get(r[d.index(k)]))
			elif 'contractnumber' == k and r[d.index(k)] and len(r[d.index(k)]) > 5 and r[d.index(k)][-4:] in dsuffix:
				l.append(r[d.index(k)][:-4] +'20/Л')
			# elif 'vinnumber' == k and r[d.index(k)] and len(r[d.index(k)]) != 17:		l.append(None)
			else:
				l.append(r[d.index(k)])
		jh = len(ttsc_order)
		heads.append([colab(jh) + '1', 'Last DATE'])
		heads.append([colab(jh+1) + '1', 'TS Type'])
		l.append(get_last_date(r[d.index('id')], r[d.index('regnum')]))
		l.append(r[d.index('tkdescription')])
		# l.append(get_ts_type(r[d.index('regnum')]))
		lines.append(l)
	fname = "ts_list_%s" % inn
	data2xlsx('Транпорт', heads, lines, fname, cwidth=cwidth)
	# print(heads)
	# print(l)
#	table_to_xlsx('vms', str(inn), query, str(inn))

def	get_ts_type (gosnun):
	global IDB_CNTR
	r = IDB_CNTR.get_row("SELECT ttname FROM ts_types WHERE id_tts = (SELECT ts_type FROM transports WHERE gosnum = '%s')" % gosnun)
	print(r, gosnun)
	return	r[0] if r else None

def	get_last_date(devid, gosnum):
	""" Читать дате последней работы ТС  """
	global IDB_CNTR
	if not IDB_CNTR:	IDB_CNTR = dbt.dbtools(ids_db['cntr'])
	query = "SELECT device_id, gosnum, last_date, bm_wtime FROM wtransports WHERE device_id = %s AND gosnum = '%s'" % (devid, gosnum)
	wad = IDB_CNTR.get_dict(query)
	if wad and wad.get('last_date'):
		date = str(wad.get('last_date'))[:10]
		return date

ttsc_order = [
	'garagenum', 'regnum', 'tmarka', 'tmodele', 'marka', 'imei', 'code', 'name', 'contractnumber', 'yearofcar',	# 'category_id', 'id',
	'operator1_id', 'phone', 'icc_id1',
	'operator2_id', 'phone2', 'icc_id2',
	'vinnumber', 'ptsnumber', 'ptsdate', 'registrationnumber', 'registrationdate', 'begindate',
	'sscode', 'tgroup']

ttsc_desc = {
	'garagenum': "Гараж. номер", 'regnum': "Гос. номер", 'tmarka': "Марка ТС", 'tmodele': "Модель ТС",
	'imei': "IMEI БНСО", 'code': "Код БНСО", 'name': "Тип БНСО", 'marka': "Марка БНСО",
	'yearofcar': "Год изготовления ТС", 'vinnumber': "VIN", 'ptsnumber': "Серия и номер ПТС", 'ptsdate': "Дата выдачи ПТС",
	'registrationnumber': "№ рег. свидетельства", 'registrationdate': "Дата рег. свидетельства", 'begindate': "Дата подключения ТС",
	'sscode': "Подсистема", 'contractnumber': "№ договора",
	'operator1_id': "Оператор 1", 'phone': "Телефон 1", 'icc_id1': "№ SIM карты 1",
	'operator2_id': "Оператор 2", 'phone2': "Телефон 2", 'icc_id2': "№ SIM карты 2",
	}


if __name__ == '__main__':
	#[5262311940, 5250068811, 5246045628пщ 	# for j in range(55):		print(colab(j))
	# table_to_xlsx('b03', 'Список пользователей', "SELECT * FROM vperson_sp ORDER BY name LIMIT 16", 'vperson_sp')
	# table_to_xlsx('cntr', 'EGTS прибор', qegts_orgs, 'egtsp_orgs')
	# vms_handbks()
	# for inn in [5249057251, 5247048220, 5254000797, 524500120268, 524504481339, 524900992249, 524908186307]:
	# 	get_org_descript(inn)
	'''	### ORGs_20200807.zip
	IDB_CNTR = dbt.dbtools(ids_db['cntr'])
	for ss in [2, 4, 8, 16, 32, 128, 256, 32768, 65536]:
		row = IDB_CNTR.get_row ("SELECT code, label, ssname FROM subsys WHERE code = %s" % ss)
		code, label, ssname = row
		print (code, label, ssname)
		orgs2xlsx(fout = label, swhere = 'bm_ssys = %s' % code)	# inns=[5249057251, 5247048220, 5254000797, 524500120268, 524504481339, 524900992249, 524908186307])
	sys.exit()
	'''
	# 2020.05.17
	# swhere = "inn IN %s ORDER BY bm_ssys" % str(inns)
	# orgs2xlsx(swhere=swhere)	#"bm_ssys>2 ORDER BY region")
	# vms_find_orgs(qand="AND contractnumber LIKE '%0/ОП'")	# Договор ретрансляции
	# inns = (5249076222, 5249084953, 5249066619, 5249066601, 521500776400, 522401215726, 5260357227, 5260410382, 5263004131, 5258121094, 5259120142, 5263133747, 5250039673, 5215000426, 5246035429)
	# inns = [5259120142, 5249084953]
	# inns = [525405675511]	# 04-20/ОП Артикул
	# inns = [5245024880]	# 05-20/ОП Меркурий НН
	'''
	# INN Santel
	inns = [5205005513, 5248035752, 5204012814, 5205000709, 5250068811, 5261113216, 5250056020, 525100054358, 521475244896, 524701328820, 5246049830, 5217003976,
		5229009027, 5226000996, 5260381460, 5246045628, 525101406034, 525100866350, 5262311940, 526301541890, 5249050619, 5225004758, 5226000410, 5226014364,
		522100130194, 5262288057, 5246046766, 5221006585]
	# 02-20/ОП Смотр
	# inns = [524504481339, 524500120268, 524503379942, 5239002285, 5261120608]
	# 03-20/ОП Ниса
	inns = [5249057251, 5249076222, 5249084953, 5249066619, 521500776400, 5249066601, 522401215726, 5260357227, 5260410382, 5263004131,
	5258121094, 5259120142, 5263133747, 5250039673, 5215000426, 5246035429, ]
	# ООО "Технотрейд НН"   5256128168
	inns = [5256128672, 5203002940, 5256083975, 5213005154, 5244027140, 5256135013, 5256087930, 5260126942, 5232003410]
	inns = [
	524908186307,	# ИП Сафин – ЕГТС (Межсерв)
	5247048220,	# МУП "Выксунское ПАП" – ЕГТС (Межсерв)
	5239010230,	# МУП "Шахунское ПАП" – Wialon
	5254000797,	# МУП «Горавтотранс» - Саров - ЕГТС (Межсерв)
	5252035184,	# ООО "АльянсАвто" – Wialon
	5249120827,	# ООО "Тройка" – Wialon
	5252028596,	# ООО «Автотайм» - Wialon
	5249138831,	# ООО Компания тройка – Wialon
		# Серафимо-Дивеевский монастырь – Wialon
	]
	inns = [	#  2020.07.03
	525600851619,	# ИП Пазюков - ЕГТС (Межсерв)
	5257057840,	# МП "КХ" – Wialon
	5256021545,	# МП РЭД Автозаводского района - ЕГТС (Межсерв)
	5263059130,	# ООО " СПЖРТ " Володарский" - ЕГТС (Межсерв)
	5256103702,	# ООО "Автодорстрой" – Wialon
	5263087032,	# ООО "Володарский" - ЕГТС (Межсерв)
	5256077756,	# ООО "Гамма" - ЕГТС (Межсерв)
	#,	# ООО "ДПП" Нижний Новгород – Wialon
	5261104275,	# ООО "Дюф-Строй" - ЕГТС (Межсерв)
	5257163775,	# ООО "Новиком" – Wialon
	5260148174,	# ООО "Партнер-ВП" – Wialon
	5258066887,	# ООО "Ремстройком" – Wialon
	5260436976,	# ООО "Экострой" – Wialon
	#,	# ООО «АТП» ( 09-20/ОП)  - ЕГТС (Межсерв)
	5262021430,	# ООО «Русский Бизнес Концерн – РУБИКОН» - ЕГТС (Межсерв)
	5212511285,	# ООО «Строй Нижний» - ЕГТС (Межсерв)
	5252005775,	# АО "Дорожное" - W
	5223003100,	# АО Нижегородец – E
	5238000045,	# АО Строитель – W
	5247015496,	# ЗАО "Дорожная компания" – E
	5247005924,	# ЗАО "ПМК "Выксунская" - E
	5234004641,	# ООО "Амиго" – W
	5246049830,	# ООО "Борская ДПМК" – W
	5246052270,	# ООО "Борское ДРСП" – W
	#,	# ООО "Вираж" – W	5245001868, 5228006922 ??? (15 и 13 машин)
	5208005776,	# ООО "ДРСУ Навашино" – E
	5237000317,	# ООО "Магистраль" – W
	5231001106,	# ООО "ПМК "Сосновская" – W
	#,	# ООО "ЭксАвтоДор" – W
	5212511285,	# ООО «Строй Нижний» - W
	5259136738,	# ООО Дорстройнн - E
	5233003349,	# ООО ДСК Тонкинская - E
	5211760056,	# ООО Радор – E
	5257009364,	# ООО фирма "Магистраль" -E
	]
	inns = [	# 2020.07.09
	5259137080,	#ООО СМК
	5256068455,	#ООО ОРБ Нижний
	5263111359,	#ООО Автоспецмонтаж
	5261092573,	#ООО Чистый двор-НН
	5257084971,	#ООО СитиЛюкс НН
	5258122475,	#ООО СИТИЛЮКС 52
	5263127359,	#ООО Мехуборка регионы
	5260375963,	#ООО Химвелл
	5261038449,	#ООО Ремонтно-эксплуатационное предприятие 2
	7734699480,	#ООО "МСК-НТ
	]
	inns = [5248024888, 5235000865, 525104198914]	# Городецпассажиравтотранс	ОАО "Автомобилист"	ИП Черненко
	inns = [
	525100069435,	# ИП  Большаков Игорь Васильевич
	520100620580,	# ИП Астахова Наталья Васильевна
	524928382620,	# ИП Вавилова Т.В.
	524400147474,	# ИП Гаголкин В.А.
	521200229893,	# ИП Евстюничев В.М.
	524503089866,	# ИП Епифанова Н.В.
	524500038574,	# ИП Калмыков Андрей Владимирович
	522100130194,	# ИП Киселев Александр Викторович
	524505960750,	# ИП Корнилов С.А.
	524500062305,	# ИП Крайнов Алексей Николаевич
	521600283133,	# ИП Маков Дивеевский
	521200348001,	# ИП Мальцева ТА
	525404171938,	# ИП Мокушин Андрей Юрьевич
	525808971930,	# ИП Радчук Владимир Иванович
	524503379942,	# ИП Серебряков Владимир Георгиевич
	525000541206,	# ИП Сизов М.Ю.
	525402105908,	# ИП Толоконников Е.Н.
	525407420981,	# ИП Фролов АС
	521000125985,	# ИП Шилков Петр Михайлович
	520100009290,	# Кондаков Сергей Борисович ИП
	]
	inns = [		# TS_Lists_20200722.zip
	5223034394,	# МП "Автостанция" г.Навашино
	5206024886,	# МП "Вадское ПАП"
	5251113834,	# МП "ПАП" - Кулебаки
	5224000045,	# МП "Первомайское ПАП"
	5240004992,	# МП «Сокольское ПАП»
	5232003410,	# МП Спасского района «Спасское ПАП»
	5229006724,	# МП"Сергачский автобус"
	5209005747,	# МУП  «Ветлужское  ПАП»
	5230004200,	# МУП "ЖКХ Сеченовское" 3 ТС(ПП)
	5217000037,	# МУП "Княгининское ЖКХ"
	5231005894,	# МУП "Сосновское ПАП"
	5237003692,	# МУП "Шарангское ПАП"
	5212510637,	# МУП «Воскресенское ПАП»
	5205004615,	# МУП Бутурлинопассажиравтотранс
	5236007599,	# МУП Чкаловское ПАП
	5246032058,	# ООО "Дилижанс"
	5222070713,	# ООО "Нижегородавтохим"
	5261109548,	# ООО "СолоАвто"
	5248016213,	# ООО "Экипаж"
	5216001849,	# ООО Дивеевская транспортная компания
	]
	inns = [		# TS_Lists_20200722.zip
	5248011984,	# АО "Городецкая ПМК-6"
	5236000466,	# ОАО "Чкаловское ДРСУ"
	5243025983,	# ООО "Дорожно-эксплуатационный участок" (ООО "ДЭУ")
	5234004994,	# ООО "Дорстройсервис"
	5228006922,	# ООО Вираж
	5245001868,	# ООО Вираж
	5243025662,	# ООО ДЭП
	5222059847,	# ООО Лысковская ДСК
	5212511278,	# ООО ПМК Воскресенская
	5263002261,	# ООО Предприятие Озеленитель
	5261103151,	# ООО СТК "Стимул"
	]
	inns = [		# TS_Lists_20200723_schools.zip
	5214005037,	# МАOУ «Гимназия № 1»
	5231003230,	# МБOУ дополнительного образования  детско-юношеская спортивная школа - Сосновский р-н
	5201002060,	# МБOУ «Ардатовская средняя школа № 2 им. С.И. Образумова»
	5201002166,	# МБOУ «Ардатовская средняя школа №1»
	5244009913,	# МБOУ «Средняя общеобразовательная школа №18»,
	5246019875,	# МБOУ Каликинская средняя школа
	5246019868,	# МБOУ Чистопольская средняя школа
	5254024808,	# МБOУ ''Школа № 13'' города Сарова
	#,	# МБУ "Центр обслуживания муниципальных образовательных учреждении"
	5238003021,	# МOУ «Архангельская средняя школа»
	5238003127,	# МOУ «Великовражская средняя школа»
	5238003102,	# МOУ «Красноборская средняя школа»
	5238002973,	# МOУ «Светлогорская средняя школа»
	5238003039,	# МOУ «Шатковская средняя школа»
	5223034370,	# МУ «Центр обслуживания системы образования»
	5239006650,	# МАОУ "Вахтанская средняя школа"
	5224002395,	# МАОУ «Сатисская средняя  школа»
	5219001244,	# МАОУ «СОШ №2 р.п.Красные Баки»
	5219001621,	# МАОУ «Средняя общеобразовательная школа №1 р.п.Красные Баки»
	5263034182,	# МАОУ «Школа  № 79 им.Н.А.Зайцева»
	5219001332,	# МАОУ Ветлужская средняя общеобразовательная школа
	5246017620,	# МАОУ Кантауровская СШ
	5219004372,	# МАОУ Кирилловская основная школа
	5246019970,	# МАОУ Лицей г. Бор
	5214004805,	# МАОУ СШ № 10
	5246053530,	# МАОУ СШ № 12 Бор
	5214002766,	# МАОУ СШ № 3 - Володарский
	#,	# МАОУ СШ №1
	5246012742,	# МАОУ СШ №11
	]
	inns = [		# tmp/TS_Lists_20200726.zip
	5250027004,	# МБОУ Работкинская средняя школа
	5233001119,	# Бердниковская основная школа МБОУ
	5247014809,	# Ближнепесоченская ОШ № 1 МБОУ
	5233001101,	# Большесодомовская ОШ МБОУ
	5205001318,	# Бутурлинский сельскохозяйственный техникум
	5209003764,	# Ветлужский лесоагротехнический техникум ГБПОУ
	5263026512,	# ГБОУ  лицей-интернат  "Центр одаренных детей"
	5217003729,	# ГБОУ ВО «Нижегородский государственный инженерно – экономический университет»
	5215011562,	# ГБОУ Дальнеконстантиновский специальный детский дом
	5247004864,	# ГБОУ Детский санаторно-оздоровительный образовательный центр Лазурный
	5257010391,	# ГБОУ ДОД ДЮЦ «Олимпиец»
	5249011698,	# ГБОУ СПО "Дзержинский педагогический колледж"
	5252009219,	# ГБОУ СПО "Павловский техникум народных художественных промыслов России"
	5243006701,	# ГБОУ СПО Арзамасский коммерческо-технический техникум
	5260054906,	# ГБОУ Центр эстетического воспитания детей Нижегородской области
	5262034782,	# ГБОУДПО Нижегородский институт развития образования
	5258000533,	# ГБОУСПО «Нижегородский промышленно-технологический техникум»
	5213002837,	# ГБОУСПО Большеболдинский сельскохозяйственный техникум
	5247007858,	# ГБОУСПО Выксунский индустриальный техникум
	5247005674,	# ГБОУСПО Выксунский металлургический колледж
	5248007949,	# ГБОУСПО Городецкий губернский  колледж
	5249011137,	# ГБОУСПО Дзержинский техникум бизнеса и технологий
	5262034912,	# ГБОУСПО Нижегородский колледж малого  бизнеса
	5257016611,	# ГБОУСПО Нижегородский техникум транспортного обслуживания и сервиса
	5228001603,	# ГБОУСПО Семеновский  индустриально-художественный техникум
	5230001329,	# ГБОУСПО Сеченовский агротехнический техникум
	5231001226,	# ГБОУСПО Сосновский агропромышленный техникум
	5239002285,	# ГБОУСПО Шахунский агропромышленный техникум
	5207001747,	# ГБПОУ "Варнавинский технолого-экономический техникум"
	5252004228,	# ГБПОУ "ПАМТ им.И.И.Лепсе"
	5226001301,	# ГБПОУ "Пильнинский агропромышленный техникум"
	5229002085,	# ГБПОУ "Сергачский агропромышленный техникум"
	5232001606,	# ГБПОУ "Спасский агропромышленный техникум"
	5244005108,	# ГБПОУ «Балахнинский технический техникум»
	5221004309,	# ГБПОУ «Лукояновский педагогический колледж им. А.М. Горького»
	5227001424,	# ГБПОУ «Починковский сельскохозяйственный техникум»
	5238001627,	# ГБПОУ «Шатковский агротехнический техникум»
	5251002274,	# ГБПОУ Кулебакский металлургический колледж
	5201002617,	# ГБПОУ Областной многопрофильный техникум
	5240002160,	# ГБПОУ Сокольский техникум индустрии сервиса и предпринимательства
	5254006686,	# ГБПОУ СПТ им. Б.Г.Музрукова
	5235007613,	# ГБПОУ УИЭТ
	5236002625,	# ГБПОУ Чкаловский техникум транспорта и информационных технологий
	5254081436,	# ГБУ "ЦСПСД города Сарова"
	5238005117,	# ГБУ «КЦСОН Шатковского района»
	5202002271,	# ГБУ «ОСРЦН «Золотой колос»
	#,	# ГБУ ДО "Центр детского и юношеского туризма и экскурсий  Нижегородской области"
	5216001180,	# ГБУЗ НО "Детский санаторий "Солнечная поляна" для лечения больных с нарушением опорно-двигательного аппарата"
	5249054099,	# ГКООУ Дзержинский санаторный детский дом
	5260048317,	# ГКООУСТ Мореновская санаторно-лесная школа
	5252011377,	# ГКООУСТ Таремский санаторный детский дом Павловский
	5252008127,	# ГКОУ «Горбатовская школа- интернат для глухих и позднооглохших детей»
	5262072273,	# ГКОУ «Нижегородская  областная специальная  (коррекционная)  школа-интернат  для слепых  и слабовидящих  детей» (НОС(К) школа-интернат)
	# ???,	# ГКОУ Большемурашкинская областная специальная общеобразовательная школа-интернат II вида
	5204000625,	# ГКОУ "Большемурашкинская школа-интернат для слабослышащих и позднооглохших детей"
	5204002220,	# ГКОУ "Большемурашкинская коррекционная школа-интернат"
	5248009248,	# ГКОУ Городецкий детский дом
	5261034772,	# ГКОУ Детский дом №3
	5236004848,	# ГКОУ для детей-сирот и детей, оставшихся без попечения родителей, «Либежевский детский дом "Кораблик"
	5214002822,	# ГКОУ Золинская специальная школа-интернат
	5262034704,	# ГКОУ Специальная школа-интернат № 1
	#,	# ГКОУ Специальный (коррекционный) детский дом 1
	5238003790,	# ГКУ "СРЦН "Ласточка" Шатковского района"
	5244009134,	# ГКУ "СРЦН Балахнинского района"
	5247011364,	# ГКУ "СРЦН г. Выкса"
	5220002355,	# ГКУ "СРЦН Краснооктябрьского района"
	5230001826,	# ГКУ "СРЦН Сеченовского района"
	5233002715,	# ГКУ "СРЦН Тонкинского района"
	5237003068,	# ГКУ "СРЦН Шарангского района"
	5260162683,	# ГКУ "СРЦН"Ласточка" Нижегородского района г. Нижнего Новгорода"
	5229002751,	# ГКУ "СРЦН"Надежда" Сергачского района"
	5246005230,	# Государственное бюджетное профессиональное образовательное учреждение  «Борский Губернский колледж»
	5244005436,	# Детский дом НиГРЭС
	5214009338,	# Кадетская школа-интернат имени Героя Российской Федерации А. Н. Рожкова
	5219003690,	# Краснобаковский детский дом
	5221002750,	# Лукояновский Губернский колледж("ГБПОУ ЛГК")
	]
	inns = [		# tmp/TS_Lists_20200727.zip
	5227004168,	# МБОУ ДО "Починковский Центр дополнительного образования"
	5243010916,	# МБОУ ДО ДООЦ "Водопрь"
	5227004104,	# МБОУ ДО Починковская ДЮСШ
	#,	# МБОУ ДОД  ДЮСШ г. Урень
	#,	# МБОУ ДОД «Дворец детского (юношеского) творчества»
	#,	# МБОУ ДОД Дальнеконстантиновский ЦДОД
	5208002486,	# МБОУ ДОД ДЮЦ «Ровесник»
	#,	# МБОУ ДОД Центр детского творчества
	5252004267,	# МБОУ ДОД ЦРТДЮ
	5245006898,	# МБОУ Доскинская школа
	5215009394,	# МБОУ Дубравская СОШ
	5229001638,	# МБОУ ДЮСШ Сергачский
	5231002212,	# МБОУ Елизаровская СОШ
	5250024437,	# МБОУ Запрудновская средняя школа
	5246014997,	# МБОУ Затонская СШ
	5216004367,	# МБОУ Ивановская СОШ Дивеевский
	5228003093,	# МБОУ Ильино-Заборская ООШ
	5213003319,	# МБОУ Исуповская СШ
	5213003421,	# МБОУ Итмановская СШ
	5216004462,	# МБОУ Ичаловская ООШ Дивеевский
	5208002528,	# МБОУ Казаковская СОШ
	# ???,	# МБОУ Каменская ОШ
		5218002855,	# МОУ "Каменская основная школа"
		5245006584,	# МБОУ "Каменская школа"
	5235001788,	# МБОУ Карповская СОШ
	5235000449,	# МБОУ Карпунихинская СОШ
	5222013218,	# МБОУ Кисловская средняя школа
	5204001812,	# МБОУ Кишкинская СОШ
	5218002686,	# МБОУ Ковернинская  СОШ №2
	5201002293,	# МБОУ Котовская СОШ
	5227003654,	# МБОУ Кочкуровская СОШ
	5232001187,	# МБОУ Красноватрасская СОШ Спасский
	5211020372,	# МБОУ Красногорская ОШ
	5246018293,	# МБОУ Краснослободская ОШ
	5210002331,	# МБОУ Криушинская СОШ
	5210001391,	# МБОУ Курихинская ООШ
	5237001222,	# МБОУ Кушнурская СОШ
	5245006802,	# МБОУ Лакшинская СОШ
	5222010591,	# МБОУ Леньковская ОШ
	5222013507,	# МБОУ Летневская СОШ
	5246018247,	# МБОУ Линдовская СШ
	5201002173,	# МБОУ Личадеевская СОШ
	5221002943,	# МБОУ Лопатинская ОШ
	5229004269,	# МБОУ Лопатинская СОШ
	5221002968,	# МБОУ Лукояновская СШ №1
	5227004048,	# МБОУ Мадаевская СШ
	# ???,	# МБОУ Макарьевская школа - Варнавинский
		5207003110,	# МБОУ Макарьевская ОШ
		5209004246,	# МОУ Макарьевская школа
	5228003142,	# МБОУ Малозиновьевская ООШ
	5221002911,	# МБОУ Маломамлеевская ОШ
	5208001362,	# МБОУ Медоварцевская ООШ
	5207001754,	# МБОУ Мирновская школа - Варнавинский
	5211020397,	# МБОУ Михайловская СШ - Воротынский
	5207003085,	# МБОУ Михаленинская ООШ
	5215010135,	# МБОУ Муравьихинская СОШ
	5227003728,	# МБОУ Наруксовская СШ
	5210002532,	# МБОУ Нарышкинская СОШ
	#,	# МБОУ Нижегородская СОШ
	5227003615,	# МБОУ Никитинская СШ
	5202002218,	# МБОУ Никольская СОШ
	5202001310,	# МБОУ Новоселковская СОШ
	5210002571,	# МБОУ Новосельская ООШ
	5208001010,	# МБОУ Новосельская СОШ
	5203000365,	# МБОУ Новослободская ОШ
	5252010359,	# МБОУ ООШ д. Лаптево
	5252010599,	# МБОУ ООШ с.Абабково
	5202001768,	# МБОУ ООШ Сельхозтехника
	5246017684,	# МБОУ Останкинская СШ
	5214004756,	# МБОУ ОШ № 11 - Володарский
	5246014500,	# МБОУ ОШ №15
	5246016970,	# МБОУ ОШ №20
	5252007941,	# МБОУ ОШ с. Вареж
	5227004023,	# МБОУ Пеля-Хованская СОШ
	5226011525,	# МБОУ Пильнинская средняя школа №2 им. А.С.Пушкина
	5229004036,	# МБОУ Пожарская СОШ
	5210001426,	# МБОУ Полх-Майданская СОШ
	5215009404,	# МБОУ Помринская ООШ
	5227003735,	# МБОУ Починковская СШ
	5247014598,	# МБОУ Проволоченская ОШ
	5222013190,	# МБОУ Просецкая СОШ
	5221002936,	# МБОУ Разинская СШ
	5227003559,	# МБОУ Ризоватовская СШ
	5237001215,	# МБОУ Роженцовская СШ
	5221003048,	# МБОУ Саврасовская ОШ
	5216003282,	# МБОУ Сатисская СОШ Дивеевский
	5207003141,	# МБОУ Северная школа
	5231003431,	# МБОУ Селитьбенская СОШ
	5218002693,	# МБОУ Семинская ОШ
	5211009058,	# МБОУ Семьянская СШ
	5229003956,	# МБОУ Сергачская СОШ №2
	5203002115,	# МБОУ Сергеевская СШ
	5218002728,	# МБОУ Скоробогатовская СОШ
	5202001479,	# МБОУ Слизневская ООШ
	5204001481,	# МБОУ Советская СОШ
	5246017638,	# МБОУ Совхозская ОШ
	5231002195,	# МБОУ Сосновская СОШ №2
	5231002283,	# МБОУ Сосновская СОШ№1
	5231002237,	# +++ МБОУ Сосновская СШ №1 ( филиал Рожковская ОШ)
	#,	# МБОУ СОШ № 1
	#,	# МБОУ СОШ № 4 г. Лысково
	5252009522,	# МБОУ СОШ №1 Горбатов
	5252008617,	# МБОУ СОШ №1 Тумботино
	5252010486,	# МБОУ СОШ №2 Ворсма
	5252010310,	# МБОУ СОШ №2 Тумботино
	#,	# МБОУ СОШ №3
	5245006785,	# МБОУ СОШ п. Центральный
	5232001170,	# МБОУ Спасская СОШ Спасский
	5214002780,	# МБОУ средняя школа № 9
	# ???,	# МБОУ средняя школа №6
		5214002519,	# МБОУ СШ № 6
		5229004195,	# МБОУ "Сергачская СОШ № 6"
		5251005162,	# МБОУ школа №6
	5201002279,	# МБОУ Стексовская СОШ
	5216004230,	# МБОУ Суворовская ООШ Дивеевский
	5252010422,	# МБОУ СШ 16 г. Павлово
	5252010454,	# МБОУ СШ № 1 г. Ворсма
	#,	# МБОУ СШ № 2
	5249054003,	# МБОУ СШ № 2 - Дзержинск
	5221002781,	# МБОУ СШ № 2 Г. ЛУКОЯНОВА
	5214005950,	# МБОУ СШ № 5 -Володарский
	5214002741,	# МБОУ СШ № 7 -Володарский
	#,	# МБОУ СШ № 8
	5246018286,	# МБОУ СШ №10 г.Бор
	5246019924,	# МБОУ СШ №22
	# >2,	# МБОУ СШ №4
	5250014157,	# МБОУ СШ с.п. Селекционной станции
	5214002808,	# МБОУ СШ№1 - Володарский
	5239006561,	# МБОУ Сявская СОШ
	5228003801,	# МБОУ Тарасихинская ООШ
	5232001148,	# МБОУ Татаромаклаковская СОШ Спасский
	5235004556,	# МБОУ Темтовская ООШ
	5227003693,	# МБОУ Ужовская СОШ
	5221002823,	# МБОУ Ульяновская СШ
	5235001160,	# МБОУ Уренская СОШ № 2
	5235001516,	# МАОУ "Уренская СОШ № 1"
	5213003453,	# МБОУ Ушаковская СШ
	5208002510,	# МБОУ Филинская СОШ
	5211090549,	# МБОУ Фокинская СОШ
	5202001246,	# МБОУ Хватовская ООШ
	5239005543,	# МБОУ Хмелевицкая СОШ
	5218002710,	# МБОУ Хохломская СОШ
	5203001866,	# МБОУ Черновская СШ
	# ???,	# МБОУ Чернухинская СШ
		5202001447,	# МБОУ "Чернухинская СШ"
		5250026829,	# МБОУ Чернухинская СШ
	5208002670,	# МБОУ Чулковская ООШ
	5228003047,	# МБОУ Шалдежская ООШ
	5237001039,	# МБОУ Шарангская средняя школа
	5202001623,	# МБОУ Шатовская СШ
	5251005162,	# МБОУ школа № 6 имени героя РФ Морева И.А.
	5251005363,	# МБОУ школа № 7 - Кулебакский
	5213003439,	# МБОУ Юрьевская СШ
	5208001355,	# МБОУ Яковцевская ООШ
	5246019730,	# МБОУ Ямновская ОШ
	5252006779,	# МБОУ Ясенецкая СОШ
	5244009310,	# МБОУ"Истоминская основная общеобразовательная школа"
	5248009424,	# МБОУ«Ковригинская основная школа»
	5250025776,	# МБОУ«Чернышихинская основная школа им.Героя Советского союза Чернова И.Н.»
	5225005938,	# МБУ «Перевозский сервисный центр»
	5204012613,	# МБУ Благоустройство ЖКХ
	5210003215,	# МБУ ДО «Вознесенский ДООЦ»
	#,	# МБУ ДО «Детско-юношеская спортивная школа г. Лысково»
	5222013313,	#| МБУ ДО "Детско-юношеский центр" г. Лысково
	5222013200,	# МБУ ДО «Дом детского творчества г. Лысково»
	5211759237,	# МБУ ДО ДООЦ "Волжский берег"
	5252011698,	# МБУ ДО ДЮСШ г. Павлово
	5262123520,	# МБУ ДО Станция юных техников
	5220000260,	# МБУ Комитет по образованию, делам молодежи и спорта
	#,	# МБУ СОМИ
	#,	# МБУ ФОК в г. Сергач НО
	#,	# МБУ ХЭС Системы образования
	5214001787,	# МБУК "Володарское СКО"
	5231005319,	# МБУК МРКЦ "Березка" с ЦКС СМР
	#,	# МКОУ  С(К)Ш Выкса
	5239006730,	# МКОУ "Сявская коррекционная школа-интернат"
	5257057858,	# МКОУ "Школа - интернат № 95"
	5204002220,	# МКОУ «Большемурашкинская коррекционная школа-интернат»
	5249055455,	# МКОУ «Дзержинская специальная коррекционная школа»
	5219001678,	# МКОУ «Краснобаковская С(К)ШИ VIII вида»
	5244011567,	# МКОУ «С(К)ОШИ» - Балахнинский
	5222013352,	# МКОУ «Чернухинская  школа - интернат »
	5248009390,	# МКОУ «Школа-интернат № 9 г. Городца»
	5212003595,	# МКОУ Благовещенская СОШ
	5212003563,	# МКОУ Владимирская СОШ
	5212004038,	# МКОУ Воздвиженская СОШ
	5212003436,	# МКОУ Воскресенская СОШ
	5212003500,	# МКОУ Галибихинская СОШ
	5216003275,	# МКОУ Глуховская СОШ
	5243009090,	# МКОУ КШ №8
	5251004962,	# МКОУ Серебрянская школа
	5240002392,	# МКОУ Сокольская СОШ
	#,	# МКОУ Специальная (коррекционная) общеобразовательная школа
	5212003570,	# МКОУ Староустинская СОШ
	#,	# МКОУ Уренская специальная (коррекционная) общеобразовательная школа-интернат VIII вида
	]
	inns = [		### data/TSType_List_2020805.zip	tmp/TS_Lists_20200803.zip
	5263133747,	#( ООО "ЭксАвтоДор"
	5260381460,	# ООО «Альянс»
	5204012814,	# ООО «Профессионал-СтройРесурс»)
	###	По району Н.Новгород 10 компаний, из них активные 3 (
	526301541890,	# ИП Постникова Ольга Ивановна
	5261113216,	# Общество с ограниченной ответственностью "Авто футболистов"
	5262288057,	# ООО «АвтоСпутник»)
	###	По району Дзержинск 11 компаний, из них активные 5
	5249050619,	# ООО "Континент"
	5249076222,	# ООО "Орбита"
	5249066601,	# ООО "Транслайн плюс"
	5249057251,	# ООО «Транслайн»
	5249066619,	# ООО "ДПП плюс"
	###	По району Бор 2 компании, из них активные 1
	5246045628,	# ООО "СтройТаун"
	]
	inns = [		### tmp/TS_Lists_20200804.zip
	5236000508,	# 	МКУ "УпОДМОУ"
	5245018847,	# МКУ "ЦОМОУ" 5245018847
	5239011709,	# МКУ «МСЦСО»
	5237003621,	# МКУ «Сервис плюс»
	5217004017,	# МКУ «ХЭГ» г.Княгинино
	5204012772,	# МКУ Информационно-методический центр
	5247015055,	# Мотмосская СШ МБОУ
	5226012423,	# МОУ "Озёрская ОШ"
	5238003078,	# МОУ «Лесогорская СШ»
	5238006537,	# МОУ «Силинская ОШ»
	5238003046,	# МОУ «Смирновская средняя школа»
	5234000580,	# МОУ «Тоншаевская средняя школа»
	5238003134,	# МОУ «Шараповская средняя школа»
	# ???,	# МОУ Архангельская ООШ
		5209004101,	# МОУ Архангельская школа
		5238003021,	# МОУ "Архангельская СШ"
	5209004278,	# МОУ Белышевская СОШ
	5226012529,	# МОУ Бортсурманская СШ
	5226012536,	# МОУ Буреполомская СОШ        5226012536
	# ???,	# МОУ Ветлужская СОШ
	# ???,	# МОУ Ветлужская СОШ № 2
	5234003119,	# МОУ Гагаринская ООШ              5234003119
	5209004415,	# МОУ Детско-юношеская спортивная школа Чайка
	5226012536,	# МОУ Деяновская ОШ
	5209003080,	# МОУ Калининская СОШ
	5218002943,	# МОУ Ковернинская СОШ № 1
	5234003334,	# МОУ Лесозаводская ООШ
	5209004246,	# МОУ Макарьевская СОШ-Ветлужский
	5226012462,	# МОУ Мало-Андосовская ОШ   5226012462
	5226012430,	# МОУ Можаров-Майданская средняя школа
	5209004140,	# МОУ Мошкинская СОШ
	5209004119,	# МОУ Новоуспенская ООШ
	5226012455,	# МОУ Петряксинский СОШ
	5234003165,	# МОУ Пижемская СОШ 5234003165
	5218002781,	# МОУ Понуровская ОШ
	5209004172,	# МОУ Туранская ООШ
	5234001915,	# МОУ Шайгинская ООШ               5234001915
	5231003449,	# МОУ Яковская СОШ
	5214005037,	# Муниципальное автономное общеобразовательное учреждение «Гимназия № 1»
	#,	# Муниципальное бюджетное образовательное учреждение дополнительного образования  детско-юношеская спортивная школа - Сосновский р-н
	]
	inns = [		### data/TS_Lists_20200805.zip
	5244009913, 5246019875, 5246019868, 5254024808, 5245018847, 5238003021, 5238003127, 5238003102,
	5238003039, 5223034370, 5201002230, 5244012200, 5257052271, 5247014534, 5218001403, 5233001133,
	5233001158, 5224000278, 5253000280, 5230001086, 5247014710, 5247015111, 5246002078, 5247014510,
	5247014936, 5259028281,
	5240002071,	# Муниципальное общеобразовательное учреждение «Светлогорская средняя школа»  "Светлогорская основная школа"
	#,	# Отдел образования администрации Сокольского муниципального района
	5240002071,	# Отдел образования администрации городского округа Сокольский
	#,	# Отдел образования администрации Тоншаевского района
	5234001873,	# Управление образования, спорта и молодежной политики администрации Тоншаевского района
	5233001172,	# Тонкинская СШ МБОУ
	]
	inns = [	### data/TS_Lists_20200807.zip
	5237001159,	# АДМ Шарангского р-на
	5250000436,	# Администрация Афонинского сельсовета Кстовского района Нижегородской области
	5230004552,	# ГАУ НО «Ледовый дворец в с. Сеченово Нижегородской области»
	5248040840,	# ГАУ НО «Физкультурно-оздоровительный комплекс в г. Городец Нижегородской области»
	5227001390,	# ГБУ "КЦСОН" ПОЧИНКОВСКОГО РАЙОНА
	5260105710,	# ГБУ НО "Автобаза управления делами Правительства Нижегородской области"
	5247053212,	# ГБУ НО «Выксунский лесхоз»
	5246005833,	# ГБУ НО «Нижегородский лесопожарный центр»
	5260295644,	# ГБУ НО «ЦИТ»
	5262114170,	# Дельфин ГБОУ ДО НОСДЮСШОР
	5250030021,	# ЗАО Тепличное
	525000060911,	# ИП Киреев Виталий Германович
	525001052864,	# ИП Порхун Г.Ю.
	5237003759,	# МАУ «Физкультурно-оздоровительный комплекс в р.п. Шаранга Нижегородской области»
	5215001684,	# МБУ СОМИ
	5231005319,	# МБУК МРКЦ "Березка" с ЦКС СМР
	5216003973,	# МКУ «Центр хозяйственного обслуживания» - Дивеево
	5223033922,	# МУК "Навашинское СКО"
	5223003117,	# Муниципальное бюджетное учреждение «Физкультурно-оздоровительный центр «Здоровье» 
	522900072015,	# Назаров Владимир Борисович
	5258117411,	# ООО "Ангелы милосердия"
	5256132894,	# ООО "Медицинский стандарт"
	5262290994,	# ООО "Медэкспресс-нн"
	5251001697,	# СМУП "Ритуальные услуги"
	5260101352,	# ФБУЗ ПОМЦ ФМБА России
	5244012049,	# ГБУЗ НО Балахнинская ЦРБ
	5245000960,	# ГБУЗ НО Богородская ЦРБ
	5248008149,	# ГБУЗ НО Городецкая ЦРБ
	]
	inns = [		### TS_Lists_20200807_schools.zip
	5215002021, 5250027050, 5222013176, 5202001327, 5251005412, 5233001091, 5202000860, 5201002159, 5250026184,
	5245006993, 5245022811, 5250012583, 5248009311, 5202001422, 5248008357, 5248014953, 5248009311, 5248009294,
	5244005612, 5228003713, 5223004015, 5201002198, 5248004698, 5248014128, 5248014093, 5201002367, 5263034175,
	5208000986, 5227003580, 5250027452, 5245022794, 5222013240,
	5246020038,	# МАОУ СШ №1
	5215002021,	# МБДОУ Дальнеконстантиновсий ДС Сказка
	5250027050,	# МБОУ  Большемокринская средняя школа
	5222013176,	# МБОУ  средняя школа № 2 г. Лысково
	5233001091,	# МБОУ "Вязовская ОШ"
	5245006993,	# МБОУ "Хвощевская школа"
	5245022811,	# МБОУ "Шварихинская школа"
	5202001895,	# МБОУ «Красносельская СШ»
	5208000986,	# МБОУ Арефинская СОШ
	5250027452,	# МБОУ Безводнинская СШ
	]
	inns = [		### tmp/TS_Lists_20200810.zip
	5215010061, 5203001087, 5203003119, 5221003070, 5246018230, 5246019804, 5202001278, 5235002742, 5207003222,
	5208002535, 5216004529, 5231002251, 5211009033, 5235001530, 5218002929, 5207001793, 5251005067, 5215009450,
	5213003319, 5221002911, 5215010103, 5247014421, 5222013313, 5222013352, 5218005180, 5245018847, 5239011709,
	5226012529, 5234002059, 5209005610,
	5229003970,       # МБОУ Богородская СОШ - Серг
	5218002703,       # МБОУ Гавриловская СОШ
	#,       # МБОУ ДОД «Дворец детского (юношеского) творчества»
	#,       # МБОУ ДОД Центр детского творчества
	#,       # МБОУ СОШ № 1 
	#,       # МБОУ СОШ № 4 г. Лысково 
	#,       # МБОУ СШ №4
		5247014710,	# Муниципальное бюджетное общеобразовательное учреждение средняя школа № 4
		5214002533,	# Муниципальное бюджетное общеобразовательное учреждение средняя школа № 4 имени Владимира Сергеевича Садового
		5229005456,	# МБОУ "Сергачская СОШ № 4"
	5251005162,       # МБОУ школа № 6 имени героя РФ Морева И.А.
	5247014750,       # МКОУ  С(К)Ш Выкса
	#,       # МКОУ Специальная (коррекционная) общеобразовательная школа
	]
	'''
	inns = [
	5254022896,	# МБОУ "Школа № 17" города Сарова 
	# НЕТ,	# МБОУ ДОД «Дворец детского (юношеского) творчества»
	# НЕТ,	# МБОУ ДОД Центр детского творчества
	5213003319,	# МБОУ Исуповская СШ
	5221002911,	# МБОУ Маломамлеевская ОШ
	# НЕТ,	# МБОУ СОШ № 1
	# НЕТ,	# МБОУ СОШ № 4 г. Лысково
	# НЕТ,	# МБОУ СШ №4
	# НЕТ,	# МБУ ДО «Детско-юношеская спортивная школа г. Лысково»
	# НЕТ,	# МКОУ Специальная (коррекционная) общеобразовательная школа 
	5239011709,	# МКУ «МСЦСО»
	]
	for inn in inns:		vms_get_ts(inn=inn)
	# receiver_get_ts()
	# contracts_get_ts(inn=5249006828)	# МУП "Экспресс" г.Дзержинск
	# vms_get_ts(inn=5243019838)	# АПАТ
	# vms_get_ts(qand="AND contractnumber LIKE '%0/ОП'")	# Договор ретрансляции
	# vms_get_ts(5247048220)	# 5247048220	МУП "Выксунское ПАП",
	# vms_get_ts(5254000797)	# 5254000797	МУП "Горавтотранс"
	# vms_get_ts(524500120268)	# 524500120268	ИП Джуга Ю.П.,
	# vms_get_ts(524504481339)	# 524504481339	ИП Куртаев А.В.,
	# vms_get_ts(524900992249)	# 524900992249	ИП Лазарев С.Ю.,
	# vms_get_ts(524908186307)	# 524908186307	ИП Сафин Х.М. и
